export const state = () => ({
  helperData: {
    family_relation: ['مستقرة', 'غير مستقرة'],
    transReason: [
      {
        text: 'حصوله علي تقيم ملحوظ علي مقياس الصحه النفسيه',
        value: 1,
      },
      {
        text: 'نظرا للشكوي المقدمة من المجند بمركز تدريب',
        value: 2,
      },
      {
        text: 'نتيجة لما ظهر علي المجند من اعراض مرضية بمركز التدريب',
        value: 3,
      },
    ],
    marital_states: ['أعزب', 'متزوج', 'مطلق', 'أرمل'],
    appearance: ['لائق', 'غير لائق'],
    focus_ability: ['جيد', 'مشتت'],

    mood: ['معتدل', 'مكتئب', 'الرغبة بالبكاء', 'تهته'],
    parent_rel: [
      {
        text: 'متزوجان',
        value: 1,
      },
      {
        text: 'منفصلان',
        value: 2,
      },
      {
        text: 'الاب متوفي',
        value: 3,
      },
      {
        text: 'الام متوفيه',
        value: 4,
      },
      {
        text: 'الاب و الام متوفيان',
        value: 5,
      },
    ],
    moving: [
      { text: 'معتدل', value: 1 },
      { text: 'كثير الحركة', value: 2 },
      { text: 'تشنجات', value: 3 },
      { text: 'تخشب', value: 4 },
    ],
    faceExprission: [
      { text: 'معتدل', value: 1 },
      { text: 'حزن وكآبه', value: 2 },
      { text: 'انبساطيه', value: 3 },
      { text: 'تبلد', value: 4 },
    ],
    timeAware: [
      { text: 'مدرك', value: 1 },
      { text: 'غير مدرك', value: 2 },
    ],
    situationAware: [
      { text: 'جيده', value: 1 },
      { text: 'ضعيفة', value: 2 },
    ],
    judgeAbility: [
      { text: 'مستبصر', value: 1 },
      { text: 'غير مستبصر', value: 2 },
    ],

    awareDisorder: [
      { text: 'لا يوجد', value: 1 },
      { text: 'هلاوس سمعية', value: 2 },
      { text: 'هلاوس بصريه', value: 3 },
      { text: 'هلاوس شمية', value: 4 },
    ],
    thinkDisorder: [
      { text: 'لا يوجد', value: 1 },
      { text: 'تشتت الافكار', value: 2 },
      { text: 'توهم العظمه', value: 3 },
      { text: 'توهم المرض', value: 4 },
      { text: 'توهم الاضطهاد', value: 5 },
      { text: 'خوف مرضي', value: 6 },
      { text: 'وساوس افكار', value: 7 },
      { text: 'وساوس افعال', value: 8 },
    ],
    yesNo: [
      { text: 'لا يوجد', value: 1 },
      { text: 'نعم', value: 2 },
    ],
    family_income: [
      { text: 'عالي', value: 1 },
      { text: 'متوسط', value: 2 },
      { text: 'ضعيف', value: 3 },
    ],
    appetite: [
      { text: 'معتدل', value: 1 },
      { text: 'فقدان الشهية', value: 2 },
      { text: 'افراط في الاكل', value: 3 },
    ],
    sleeping: [
      { text: 'معتدل', value: 1 },
      { text: 'أرق', value: 2 },
      { text: 'الكلام اثناء النوم', value: 3 },
      { text: 'مشي اثناء النوم', value: 4 },
      { text: 'كوابيس', value: 5 },
    ],
    smoking: [
      { text: 'لا', value: 1 },
      { text: 'نعم', value: 2 },
    ],
    prayer: [
      { text: 'منتظم', value: 1 },
      { text: 'غير منتظم', value: 2 },
      { text: 'منقطع', value: 3 },
    ],
    interviewEntqaDone: [
      {
        text: 'تم عرضه على الفرع',
        value: 1,
      },
      {
        text: 'لم يتم عرضه على الفرع',
        value: 0,
      },
    ],
    recommendation: [
      {
        text: 'عرض مست نفسى فرع',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعرض المجند على مست أحمد جلال العسكري للتأكد من صحة شكواه و موافتنا بنتائج العرض علي المستشفي و في حالة ترحيل المجند يتم ارسال وحدته و نقطة تمركزه',
        value: 1,
      },
      {
        text: 'عرض مست طبى كوبري القبه فرع',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعرض المجند على مست كوبري القبه العسكري للتأكد من صحة شكواه و موافتنا بنتائج العرض علي المستشفي و في حالة ترحيل المجند يتم ارسال وحدته و نقطة تمركزه',
        value: 2,
      },
      {
        text: 'عرض مست طبى الحلميه فرع',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعرض المجند على مست الحلميه العسكري للتأكد من صحة شكواه و موافتنا بنتائج العرض علي المستشفي و في حالة ترحيل المجند يتم ارسال وحدته و نقطة تمركزه',
        value: 3,
      },
      {
        text: 'موقف إقتصادى /إجتماعى',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعودة المجند الي الوحده حيث انه لا يعاني من اي مشاكل نفسيه او طبيه حتي الان الا انه تآزمه مشكلة اقتصاديه قد تجعله عرضه للمرض النفسي لذا يرجي دراسة الحاله الاجتماعيه للمجند عن طريق ضابط الخدمه الاجتماعيه للوقوف علي حالته الاقتصاديه ومراعاة تلك الشكوه بواسطة وحدته في حالة تأكد من صحة شكواه',
        value: 4,
      },
      {
        text: 'عودة للوحدة',
        comment:
          'يوصي فرع الانتقاء و التوجيه بعودة المجند للوحده حيث انه لا يعاني من اي مشاكل نفسية او طبيه حتي الان و في حال ظهور اي اعراض علي المجند يتم تحويله لاقرب مست نفسي عسكري مع المتابعه الدوريه له و ارسال تقرير سلوكي عن حالته كل ثلاث شهور عن طريق وحدته المرحل عليها',
        value: 5,
      },
      {
        text: 'نفسى +إقتصادى',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعرض المجند على مست أحمد جلال العسكري للتأكد من صحة شكواه و موافتنا بنتائج العرض علي المستشفي و في حالة ترحيل المجند يتم ارسال وحدته و نقطة تمركزه كما يوصي فرع الانتقاء و التوجيه دراسة الحاله الاجتماعيه للمجند عن طريق ضابط الخدمه الاجتماعيه للوقوف علي حالته الاقتصاديه ومراعاة تلك الشكوه بواسطة وحدته في حالة تأكد من صحة شكواه',
        value: 6,
      },
      {
        text: 'طبى+إقتصادى',
        comment:
          'يوصى فرع الإنتقاءوالتوجيه بعرض المجند على مست ......... طبي عسكري  للتأكد من صحة شكواه و موافتنا بنتائج العرض علي المستشفي و في حالة ترحيل المجند يتم ارسال وحدته و نقطة تمركزه كما يوصي فرع الانتقاء و التوجيه دراسة الحاله الاجتماعيه للمجند عن طريق ضابط الخدمه الاجتماعيه للوقوف علي حالته الاقتصاديه ومراعاة تلك الشكوه بواسطة وحدته في حالة تأكد من صحة شكواه',
        value: 7,
      },
    ],
    recommendation_res: [
      { text: 'منتظر عرض', value: 1 },
      { text: 'عودة للوحده', value: 2 },
      { text: 'رفت', value: 3 },
      { text: 'غياب', value: 4 },
      { text: 'موقف امني', value: 5 },
    ],
    report: [
      { text: 'مختبرين لكل مركز', value: 1 },
      { text: 'تقرير مجمع للمرحلة', value: 2 },
    ],
    final_hospital_result: [
      'لا يوجد',
      'عودة للوحدة',
      'علاج و عودة للوحدة',
      'رفت طبي',
      'رفت نفسي',
    ],
  },
})
export const getters = {
  helperData(state) {
    return state.helperData
  },
}
